---
kind: method
id: M:Autodesk.Revit.DB.SymbolGeometryId.Dispose
source: html/62489efe-a398-9d2c-3fc3-3d3dbe65fff5.htm
---
# Autodesk.Revit.DB.SymbolGeometryId.Dispose Method

Releases all resources used by the SymbolGeometryId

## Syntax (C#)
```csharp
public void Dispose()
```